**Projet Machine Learning**

In [13]:
import pandas as pd
import numpy as np
import bokeh as bk
from bokeh.plotting import figure, show

In [11]:
import pandas as pd
file_names = {
    "primary_cohort": "data/s41598-020-73558-3_sepsis_survival_primary_cohort.csv",
    "study_cohort": "data/s41598-020-73558-3_sepsis_survival_study_cohort.csv",
    "validation_cohort": "data/s41598-020-73558-3_sepsis_survival_validation_cohort.csv",
}
dict_df = dict()
for key, file in file_names.items():
    dict_df[key] = pd.read_csv(file)

In [12]:
dict_df["primary_cohort"]

,age_years,sex_0male_1female,episode_number,hospital_outcome_1alive_0dead
0,21,1,1,1
1,20,1,1,1
2,21,1,1,1
3,77,0,1,1
4,72,0,1,1
...,...,...,...,...
110199,0,0,1,1
110200,0,1,1,1
110201,70,1,1,1
110202,0,0,1,1
110203,0,0,1,1

In [6]:
dict_df["study_cohort"]

,age_years,sex_0male_1female,episode_number,hospital_outcome_1alive_0dead
0,7,1,1,1
1,17,0,2,1
2,70,0,1,1
3,76,0,1,1
4,8,0,1,1
...,...,...,...,...
19046,33,1,1,1
19047,58,0,1,1
19048,44,0,2,1
19049,61,0,3,0
19050,78,0,1,1

In [7]:
dict_df["validation_cohort"]

,age_years,sex_0male_1female,episode_number,hospital_outcome_1alive_0dead
0,20,0,1,1
1,22,0,1,1
2,26,1,2,0
3,33,1,1,1
4,33,0,1,1
...,...,...,...,...
132,47,0,1,1
133,50,0,1,0
134,62,0,1,1
135,58,0,1,0
136,55,1,1,1

In [14]:
age = dict_df["study_cohort"]["age_years"]
deadoralive = dict_df["study_cohort"]["hospital_outcome_1alive_0dead"]

p = figure()
p.scatter(age, deadoralive, legend_label="Age", color="#bb5566", size=8)
show(p)